project/src/DataProcessors/СравнениеМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>СравнениеМетаданных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсходнаяКонфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонфигурацияСравнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конвертация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

project/src/Catalogs/ПравилаКонвертацииПредопределенныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииПредопределенныхДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьГруппыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектКонфигурацииКорреспондент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКонфигурацииКорреспондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Захвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъектаВФайлОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриЗагрузкеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременнаяКопия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКонфигурацииКорреспондент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТегВырезки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ПравилаКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяАлгоритмКонвертации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоКонвертацииСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьИзВходящихДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОбработкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗамещать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПриводитьЗначениеКДлинеПриемника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПараметраДляПередачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоДатеНаРавенство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьГруппуЧерезФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/СоставыКонвертаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СоставыКонвертаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конвертации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементКонвертации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииПредопределенныхДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Алгоритмы</v8:Type>
						<v8:Type>cfg:CatalogRef.Запросы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/DataProcessors/СравнениеМетаданных/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолныйРезультатСравнения = Новый ХранилищеЗначения(Новый ДеревоЗначений);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРезультатСравненияПриАктивизацииСтроки(Элемент)
	Если Элементы.ДеревоРезультатСравнения.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Источник = Элементы.ДеревоРезультатСравнения.ТекущиеДанные.ИсходнаяКонфигурация;
	Приемник = Элементы.ДеревоРезультатСравнения.ТекущиеДанные.КонфигурацияСравнения;

	ДеревоРезультатСравненияПриАктивизацииСтрокиНаСервере(Источник, Приемник);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СравнитьКонфигурации(Команда)
	Если ПроверитьЗаполнение() = Ложь Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ИсходнаяКонфигурация = Объект.КонфигурацияСравнения Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Конфигурации совпадают'"));
		Возврат;
	КонецЕсли;
	
	СравнитьКонфигурацииНаСервере();
	РазвернутьДерево();
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьОтбор(Команда)
	ОбновитьОтборНаСервере();
	РазвернутьДерево();
КонецПроцедуры
&НаКлиенте
Процедура ПерейтиКПравилу(Команда)
	ДанныеДерева = Элементы.ДеревоРезультатСравнения.ТекущиеДанные;
	Если ДанныеДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указана конвертация'"));
		Возврат;
	КонецЕсли;
	УровеньДерева = Уровень(ДанныеДерева);
	Если УровеньДерева < 2 Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "";
	ИмяФормыДляПоказа = "";
	КлючФормы = Неопределено;
	ДопПараметрыФормы = Новый Структура;
	СтрокаДляПКО = ДанныеДерева;
	Если УровеньДерева > 2 Тогда
	    УровеньДереваЛокальный = УровеньДерева;
		Пока УровеньДереваЛокальный > 2 Цикл
			
			СтрокаДляПКО = СтрокаДляПКО.ПолучитьРодителя();	
			УровеньДереваЛокальный = Уровень(СтрокаДляПКО);
			
		КонецЦикла;
	КонецЕсли;
	Источник = СтрокаДляПКО.ИсходнаяКонфигурация;	
	Приемник = СтрокаДляПКО.КонфигурацияСравнения;
	ПараметрыФормы = Новый Структура("ИмяФормыДляПоказа, КлючФормы, ДополнительныеПараметрыФормы", ИмяФормыДляПоказа, КлючФормы, ДопПараметрыФормы);
	ПерейтиКПравилуНаСервере(Источник, Приемник, ДанныеДерева.ИсходнаяКонфигурация, ДанныеДерева.КонфигурацияСравнения,  УровеньДерева, ПараметрыФормы, ТекстСообщения);
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяФормыДляПоказа) Тогда
		Если ДопПараметрыФормы.Количество() > 0 Тогда
			ДопПараметрыФормы.Вставить("Ключ", КлючФормы);
			ОткрытьФорму(ИмяФормыДляПоказа, ДопПараметрыФормы);
		Иначе
			ОткрытьФорму(ИмяФормыДляПоказа, Новый Структура("Ключ", КлючФормы));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ДеревоРезультатСравненияПриАктивизацииСтрокиНаСервере(Источник, Приемник)
	ТаблицаТипов = Новый ТаблицаЗначений;
	ТаблицаТипов.Колонки.Добавить("ТипИсточника");
	ТаблицаТипов.Колонки.Добавить("ТипПриемника");
	ТаблицаТипов.Колонки.Добавить("ИмяТипаИсточника");

	ОпределитьРазницуТипов(ТаблицаТипов, Источник, Приемник);	
	ЗначениеВРеквизитФормы(ТаблицаТипов, "ТаблицаСравненияТипов");

КонецПроцедуры
&НаСервере
Процедура ПерейтиКПравилуНаСервере(ОбъектИсточник, ОбъектПриемник, Источник, Приемник, УровеньДерева, ПараметрыФормы, ТекстСообщения)
	ИмяФормыДляПоказа = ПараметрыФормы.ИмяФормыДляПоказа;
	КлючФормы = ПараметрыФормы.КлючФормы;
	ДополнительныеПараметрыФормы = ПараметрыФормы.ДополнительныеПараметрыФормы;
	МассивПКО = ПолучитьПКО(ОбъектИсточник, ОбъектПриемник);
	Если МассивПКО.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Правила не найдены'");
		Возврат;
	КонецЕсли;
	КлючФормы = МассивПКО[0];
	Если ТипЗнч(КлючФормы) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		ИмяФормыДляПоказа = "Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента";
	Иначе
		ТипКонвертации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "ТипКонвертации");
		Если ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO Тогда
			ИмяФормыДляПоказа = "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXDTO";
		Иначе
			ИмяФормыДляПоказа = "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXML";
		КонецЕсли;
	КонецЕсли;
	Если УровеньДерева = 2
		ИЛИ (Не ЗначениеЗаполнено(Источник)
			И Не ЗначениеЗаполнено(Приемник)) Тогда
		
		Возврат;
		
	КонецЕсли;
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Свойства")
		ИЛИ ТипЗнч(Приемник) = Тип("СправочникСсылка.Свойства") Тогда
		
		МассивОбъектов = Новый Массив();
		Если ЗначениеЗаполнено(Источник) Тогда
			МассивОбъектов.Добавить(Источник);
		КонецЕсли;
		Если ЗначениеЗаполнено(Приемник) Тогда
			МассивОбъектов.Добавить(Приемник);
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПравилаКонвертацииСвойств.Ссылка КАК ПКС
	               |ИЗ
	               |	Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
				   |ГДЕ 
				   |	ПравилаКонвертацииСвойств.Владелец В (&МассивПКО)
				   |	И (ПравилаКонвертацииСвойств.СвойствоКонфигурации В (&МассивОбъектов)
				   |		ИЛИ ПравилаКонвертацииСвойств.СвойствоКонфигурацииКорреспондента В (&МассивОбъектов) )
				   |	И ПравилаКонвертацииСвойств.ПометкаУдаления = ЛОЖЬ";
				   
		Запрос.УстановитьПараметр("МассивПКО", МассивПКО);
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
		МассивПКС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПКС");
		
		Если МассивПКС.Количество() > 0 Тогда
			ДополнительныеПараметрыФормы.Вставить("ТекущееПКС", МассивПКС[0]);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Значения")
		ИЛИ ТипЗнч(Приемник) = Тип("СправочникСсылка.Значения") Тогда
		
		ТипКонвертации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "ТипКонвертации");
		Если ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO Тогда
			ИмяФормыДляПоказа = "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXDTO";
		Иначе
			ИмяФормыДляПоказа = "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXML";
		КонецЕсли;
		КлючФормы = МассивПКО[0];
		Если МассивПКО.Количество() > 1 Тогда
			Для Каждого ТекПКО Из МассивПКО Цикл
				Если ТипЗнч(КлючФормы) = Тип("СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных") Тогда
					КлючФормы = ТекПКО;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		МассивОбъектов = Новый Массив();
		Если ЗначениеЗаполнено(Источник) Тогда
			МассивОбъектов.Добавить(СокрЛП(Источник));
		КонецЕсли;
		Если ЗначениеЗаполнено(Приемник) Тогда
			МассивОбъектов.Добавить(СокрЛП(Приемник));
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПравилаКонвертацииЗначений.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК ПравилаКонвертацииЗначений
				   |ГДЕ 
				   |	ПравилаКонвертацииЗначений.Ссылка В (&МассивПКО)
				   |	И (ПравилаКонвертацииЗначений.ЗначениеКонфигурации В (&МассивОбъектов)
				   |		ИЛИ ПравилаКонвертацииЗначений.ЗначениеКонфигурацииКорреспондент В (&МассивОбъектов) )
				   |	И ПравилаКонвертацииЗначений.Ссылка.ПометкаУдаления = ЛОЖЬ";
				   
		Запрос.УстановитьПараметр("МассивПКО", МассивПКО);
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
		МассивПКЗ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПКЗ");
		Если МассивПКЗ.Количество() > 0 Тогда
			ДополнительныеПараметрыФормы.Вставить("НомерСтрокиПКЗ", МассивПКЗ[0]);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СравнитьКонфигурацииНаСервере()
	ДеревоДляЗаполнения = РеквизитФормыВЗначение("ДеревоРезультатСравнения", Тип("ДеревоЗначений"));
	ДеревоДляЗаполнения.Строки.Очистить();
	ЗапросОбъектов = Новый Запрос(
		"ВЫБРАТЬ
		|	ОбъектыПриемника.Тип КАК Тип,
		|	ОбъектыПриемника.Ссылка КАК Приемник,
		|	ОбъектыПриемника.Наименование КАК Наименование
		|ПОМЕСТИТЬ Приемники
		|ИЗ
		|	Справочник.Объекты КАК ОбъектыПриемника
		|ГДЕ
		|	ОбъектыПриемника.ПометкаУдаления = ЛОЖЬ
		|	И ОбъектыПриемника.ЭтоГруппа = ЛОЖЬ
		|	И ОбъектыПриемника.Владелец = &КонфигурацияПриемник
		|	И (НЕ ОбъектыПриемника.Тип В (&МассивТипов)) 
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СинхронизированныеОбъекты.Тип КАК Тип,
		|	СинхронизированныеОбъекты.Источник КАК Источник,
		|	СинхронизированныеОбъекты.Приемник КАК Приемник
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА Источники.Тип ЕСТЬ NULL 
		|				ТОГДА Приемники.Тип
		|			ИНАЧЕ Источники.Тип
		|		КОНЕЦ КАК Тип,
		|		Источники.Источник КАК Источник,
		|		Приемники.Приемник КАК Приемник
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ОбъектыИсточника.Тип КАК Тип,
		|			ОбъектыИсточника.Ссылка КАК Источник,
		|			ОбъектыИсточника.Наименование КАК Наименование
		|		ИЗ
		|			Справочник.Объекты КАК ОбъектыИсточника
		|		ГДЕ
		|			ОбъектыИсточника.ПометкаУдаления = ЛОЖЬ
		|			И ОбъектыИсточника.ЭтоГруппа = ЛОЖЬ
		|			И ОбъектыИсточника.Владелец = &КонфигурацияИсточник
		|			И (НЕ ОбъектыИсточника.Тип В (&МассивТипов))) КАК Источники
		|			ПОЛНОЕ СОЕДИНЕНИЕ Приемники
		|			ПО Источники.Наименование = Приемники.Наименование
		|				И Источники.Тип = Приемники.Тип) КАК СинхронизированныеОбъекты
		|");
		
	МассивТипов = ТипыПоКоторымНеВыполняетсяСинхронизацияПКО();
	
	ЗапросОбъектов.УстановитьПараметр("МассивТипов", МассивТипов);	
	ЗапросОбъектов.УстановитьПараметр("КонфигурацияИсточник", Объект.ИсходнаяКонфигурация);
	ЗапросОбъектов.УстановитьПараметр("КонфигурацияПриемник", Объект.КонфигурацияСравнения);
	ЗапросОбъектов.УстановитьПараметр("ПустойОбъект", Справочники.Объекты.ПустаяСсылка());
	
	ТаблицаДанныхСравнения = ЗапросОбъектов.Выполнить().Выгрузить();
	
	СтрокаОсновнаяДерева = ДеревоДляЗаполнения.Строки.Добавить();
	СтрокаОсновнаяДерева.ИсходнаяКонфигурация = "Конфигурация";
	СтрокаОсновнаяДерева.КонфигурацияСравнения = "Конфигурация";
	
	КоличествоСтрок = ТаблицаДанныхСравнения.Количество();
	Для Каждого СтрокаТаблицы Из ТаблицаДанныхСравнения Цикл
		
		СтрокаРодителя = НайтиПоСтрокеОбъектовРодителя(СтрокаОсновнаяДерева, СтрокаТаблицы);
		СтрокаДобавления = СтрокаРодителя.Строки.Добавить();	
		СтрокаДобавления.РезультатСравнения = 0;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Источник) Тогда
			СтрокаДобавления.ИсходнаяКонфигурация = СтрокаТаблицы.Источник;
			СтрокаДобавления.ТипИсточника = СтрокаТаблицы.Тип;
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Приемник) Тогда
				СтрокаДобавления.РезультатСравнения = 1;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Приемник) Тогда
			СтрокаДобавления.КонфигурацияСравнения = СтрокаТаблицы.Приемник;
			СтрокаДобавления.ТипПриемника = СтрокаТаблицы.Тип;
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Источник) Тогда
				СтрокаДобавления.РезультатСравнения = 2;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаДобавления.РезультатСравнения = 0 Тогда
			
			ПоказатьРазличияСвойствМетаданного(СтрокаДобавления);	
			ПоказатьРазличияЗначенийМетаданного(СтрокаДобавления);
			
		КонецЕсли;
		
	КонецЦикла;
	УдалитьРекурсивноНеНужныеСтрокиДерева(ДеревоДляЗаполнения.Строки);	
	ПолныйРезультатСравнения = Новый ХранилищеЗначения(ДеревоДляЗаполнения);

	ПрименитьФильтрациюПриВыводеДерева(ДеревоДляЗаполнения);

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборНаСервере()
	ПрименитьФильтрациюПриВыводеДерева();
КонецПроцедуры

&НаСервере
Функция ТипыПоКоторымНеВыполняетсяСинхронизацияПКО()
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.НаборКонстант);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.Строка);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.Число);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.Булево);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.Дата);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.ХранилищеЗначения);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.УникальныйИдентификатор);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.Календарь);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.РегистрБухгалтерии);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.РегистрНакопления);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.РегистрРасчета);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.ПланОбмена);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.БизнесПроцесс);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.Задача);
	МассивТипов.Добавить(Перечисления.ТипыОбъектов.ТочкаМаршрутаБизнесПроцесса);
	
	Возврат МассивТипов;
	
КонецФункции

&НаСервере
Функция НайтиПоСтрокеОбъектовРодителя(СтрокаОсновнаяДерева, СтрокаТаблицы)
	
	СтрокаРодителя = СтрокаОсновнаяДерева.Строки.Найти(СтрокаТаблицы.Тип, "ИсходнаяКонфигурация");
	
	Если СтрокаРодителя = Неопределено Тогда
		
		СтрокаРодителя = СтрокаОсновнаяДерева.Строки.Добавить();
		СтрокаРодителя.ИсходнаяКонфигурация = СтрокаТаблицы.Тип;
		СтрокаРодителя.КонфигурацияСравнения = СтрокаТаблицы.Тип;
		
	КонецЕсли;
	
	Возврат СтрокаРодителя;
	
КонецФункции

&НаСервере
Процедура ПоказатьРазличияЗначенийМетаданного(СтрокаДереваРазличий)
	
	ОбъектИсточник = СтрокаДереваРазличий.ИсходнаяКонфигурация;
	ОбъектСравнения = СтрокаДереваРазличий.КонфигурацияСравнения;	
	
	Если ОбъектИсточник = ОбъектСравнения Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Значения.Ссылка,
	               |	Значения.Наименование КАК Наименование,
	               |	Значения.Владелец КАК Владелец
	               |ИЗ
	               |	Справочник.Значения КАК Значения
	               |ГДЕ
	               |	Значения.Владелец В(&МассивВладельцев)
	               |	И Значения.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Владелец,
	               |	Наименование
	               |ИТОГИ ПО
	               |	Владелец";
				   
	МассивВладельцев = Новый Массив();
	МассивВладельцев.Добавить(ОбъектИсточник);
	МассивВладельцев.Добавить(ОбъектСравнения);
				   
	Запрос.УстановитьПараметр("МассивВладельцев", МассивВладельцев);
	
	СоответствиеИсточника = Новый ТаблицаЗначений;
	СоответствиеИсточника.Колонки.Добавить("Источник");
	СоответствиеИсточника.Колонки.Добавить("Приемник");
	СоответствиеИсточника.Колонки.Добавить("Наименование");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка)
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.Владелец) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоИсточник = (Выборка.Владелец = ОбъектИсточник);
		
		СтрокаТаблицы = СоответствиеИсточника.Найти(Выборка.Наименование, "Наименование");
		
		Если СтрокаТаблицы = Неопределено Тогда
			
			СтрокаТаблицы = СоответствиеИсточника.Добавить();
			СтрокаТаблицы.Наименование = Выборка.Наименование;
			
			Если ЭтоИсточник Тогда
				СтрокаТаблицы.Источник = Выборка.Ссылка;
			Иначе
				СтрокаТаблицы.Приемник = Выборка.Ссылка;
			КонецЕсли;
			
		Иначе
			
			СоответствиеИсточника.Удалить(СтрокаТаблицы);	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СоответствиеИсточника.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПредопределенныеСтроки = СтрокаДереваРазличий.Строки.Добавить();
	ПредопределенныеСтроки.ИсходнаяКонфигурация = "Предопределенные";
	ПредопределенныеСтроки.КонфигурацияСравнения = "Предопределенные";
	
	Для Каждого СтрокаТаблицы Из СоответствиеИсточника Цикл
		
		СтрокаДобавления = ПредопределенныеСтроки.Строки.Добавить();	
		СтрокаДобавления.ИсходнаяКонфигурация = СтрокаТаблицы.Источник;
		СтрокаДобавления.КонфигурацияСравнения = СтрокаТаблицы.Приемник;
		
		Если ЗначениеЗаполнено(СтрокаДобавления.ИсходнаяКонфигурация) Тогда
			СтрокаДобавления.РезультатСравнения = 1;
			СтрокаДобавления.ВидИсточника = Перечисления.ВидыСвойств.Свойство;
		Иначе
			СтрокаДобавления.РезультатСравнения = 2;
			СтрокаДобавления.ВидПриемника = Перечисления.ВидыСвойств.Свойство;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьРазличияСвойствМетаданного(СтрокаДереваРазличий)
	
	ОбъектИсточник = СтрокаДереваРазличий.ИсходнаяКонфигурация;
	ОбъектСравнения = СтрокаДереваРазличий.КонфигурацияСравнения;	
	
	Если ОбъектИсточник = ОбъектСравнения Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Свойства.Ссылка,
	               |	Свойства.Родитель КАК Родитель,
	               |	Свойства.Родитель.Наименование КАК НаименованиеРодителя,
	               |	Свойства.Родитель.Вид КАК ВидРодителя,
	               |	Свойства.ЭтоГруппа КАК ЭтоГруппа,
	               |	Свойства.Наименование КАК Наименование,
	               |	Свойства.Владелец КАК Владелец,
	               |	Свойства.Вид,
	               |	Свойства.ТипыСтрокой
	               |ИЗ
	               |	Справочник.Свойства КАК Свойства
	               |ГДЕ
	               |	Свойства.Владелец В(&МассивВладельцев)
	               |	И Свойства.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Владелец,
	               |	Родитель,
	               |	ЭтоГруппа,
	               |	Наименование
	               |ИТОГИ ПО
	               |	Владелец,
	               |	Родитель ИЕРАРХИЯ";
				   
	МассивВладельцев = Новый Массив();
	МассивВладельцев.Добавить(ОбъектИсточник);
	МассивВладельцев.Добавить(ОбъектСравнения);
				   
	Запрос.УстановитьПараметр("МассивВладельцев", МассивВладельцев);
	
	СоответствиеИсточника = Новый ДеревоЗначений;
	СоответствиеИсточника.Колонки.Добавить("Источник");
	СоответствиеИсточника.Колонки.Добавить("Приемник");
	СоответствиеИсточника.Колонки.Добавить("Наименование");
	СоответствиеИсточника.Колонки.Добавить("ЭтоГруппаИсточник");
	СоответствиеИсточника.Колонки.Добавить("ЭтоГруппаПриемник");
	СоответствиеИсточника.Колонки.Добавить("ТипыИсточника");
	СоответствиеИсточника.Колонки.Добавить("ТипыПриемника");
	СоответствиеИсточника.Колонки.Добавить("ВидИсточника");
	СоответствиеИсточника.Колонки.Добавить("ВидПриемника");
	СоответствиеИсточника.Колонки.Добавить("Вид");
	
	СтруктураПоиска = Новый Структура("Наименование, Вид");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка)
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.Владелец) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоИсточник = (Выборка.Владелец = ОбъектИсточник);
		
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			
			ОбъектПоиска = Неопределено;
			
			Если ЭтоИсточник Тогда
				ОбъектПоиска = СоответствиеИсточника.Строки.Найти(Выборка.Родитель, "Источник");
			Иначе
				ОбъектПоиска = СоответствиеИсточника.Строки.Найти(Выборка.Родитель, "Приемник");
			КонецЕсли;
			
			Если ОбъектПоиска = Неопределено Тогда
				
				СтруктураПоиска.Наименование = Выборка.НаименованиеРодителя;
				СтруктураПоиска.Вид			 = Выборка.ВидРодителя;
				
				ОбъектыПоиска = СоответствиеИсточника.Строки.НайтиСтроки(СтруктураПоиска);
				Если ОбъектыПоиска.Количество() <> 0 Тогда
					
					ОбъектПоиска = ОбъектыПоиска[0];
					
				Иначе
					
					Продолжить;
				КонецЕсли;
								
			КонецЕсли;
			
		Иначе
			
			ОбъектПоиска = СоответствиеИсточника;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		СтрокиДерева = ОбъектПоиска.Строки.НайтиСтроки(СтруктураПоиска);
		Если СтрокиДерева.Количество() = 0 Тогда		
			СтрокаДерева = ОбъектПоиска.Строки.Добавить();
		Иначе
			СтрокаДерева = СтрокиДерева[0];
		КонецЕсли;
				
		Если СтрокаДерева = Неопределено Тогда		
			СтрокаДерева = ОбъектПоиска.Строки.Добавить();
		КонецЕсли;
		
		Если ЭтоИсточник Тогда
			СтрокаДерева.Источник = Выборка.Ссылка;
			СтрокаДерева.ЭтоГруппаИсточник = Выборка.ЭтоГруппа;
			СтрокаДерева.ТипыИсточника = Выборка.ТипыСтрокой;
			СтрокаДерева.ВидИсточника = Выборка.Вид;
		Иначе
			СтрокаДерева.Приемник = Выборка.Ссылка;
			СтрокаДерева.ЭтоГруппаПриемник = Выборка.ЭтоГруппа;
			СтрокаДерева.ТипыПриемника = Выборка.ТипыСтрокой;
			СтрокаДерева.ВидПриемника = Выборка.Вид;
		КонецЕсли;
		
		Если ПустаяСтрока(СтрокаДерева.Наименование)
			И Не ПустаяСтрока(Выборка.Наименование) Тогда
			
			СтрокаДерева.Наименование = Выборка.Наименование;
			
		КонецЕсли;
		
		Если (НЕ ЗначениеЗаполнено(СтрокаДерева.Вид))
			И ЗначениеЗаполнено(Выборка.Вид) Тогда
			СтрокаДерева.Вид = Выборка.Вид;
		КонецЕсли;
								
	КонецЦикла;
	
	Для Каждого СтрокаДереваСравнения Из СоответствиеИсточника.Строки Цикл
		
		НужноДобавитьСтроку = ОпределитьНужноВыгружатьСтроку(СтрокаДереваСравнения);
				
		Если НужноДобавитьСтроку Тогда
			СтрокаДерева = ДобавитьСтрокуВОбщееДерево(СтрокаДереваРазличий, СтрокаДереваСравнения);
			// добавляем строку но не детализируем ее
			Продолжить;
		Иначе
			СтрокаДерева = Неопределено;	
		КонецЕсли;		
		
		Для Каждого ВложеннаяСтрока Из СтрокаДереваСравнения.Строки Цикл
			
			НужноДобавитьСтроку = ОпределитьНужноВыгружатьСтроку(ВложеннаяСтрока);	
			
			Если НужноДобавитьСтроку Тогда
				
				Если СтрокаДерева = Неопределено Тогда
					
					СтрокаДерева = ДобавитьСтрокуВОбщееДерево(СтрокаДереваРазличий, СтрокаДереваСравнения);	
					
				КонецЕсли;
				
				ДобавитьСтрокуВОбщееДерево(СтрокаДерева, ВложеннаяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьНужноВыгружатьСтроку(СтрокаСравнения)
	
	Если НЕ ЗначениеЗаполнено(СтрокаСравнения.Источник)
		ИЛИ НЕ ЗначениеЗаполнено(СтрокаСравнения.Приемник) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если СтрокаСравнения.ЭтоГруппаИсточник <> СтрокаСравнения.ЭтоГруппаПриемник
		ИЛИ СтрокаСравнения.ВидИсточника <> СтрокаСравнения.ВидПриемника Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если СтрокаСравнения.ТипыИсточника <> СтрокаСравнения.ТипыПриемника Тогда
		
		Если СтрДлина(СтрокаСравнения.ТипыИсточника) = СтрДлина(СтрокаСравнения.ТипыПриемника) Тогда
			
			ТаблицаТипов = Новый ТаблицаЗначений;
			ТаблицаТипов.Колонки.Добавить("ТипИсточника");
			ТаблицаТипов.Колонки.Добавить("ТипПриемника");
			ТаблицаТипов.Колонки.Добавить("ИмяТипаИсточника");
			
			// возможно типы все таки совпадают
			ОпределитьРазницуТипов(ТаблицаТипов, СтрокаСравнения.Источник, СтрокаСравнения.Приемник);
			
			Если ТаблицаТипов.Количество() > 0 Тогда
			
				Возврат Истина;
				
			КонецЕсли;
			
			// для строк, чисел и дат дополнительное сравнение необходимо
			НаличиеЧислаВТипе = Найти(СтрокаСравнения.ТипыИсточника, "Число"); 
			
			Если НаличиеЧислаВТипе
				И (СтрокаСравнения.Источник.КвалификаторыЧисла_Длина <> СтрокаСравнения.Приемник.КвалификаторыЧисла_Длина
					ИЛИ СтрокаСравнения.Источник.КвалификаторыЧисла_Точность <> СтрокаСравнения.Приемник.КвалификаторыЧисла_Точность) Тогда
				
				Возврат Истина;	
				
			КонецЕсли;
			
			НаличиеСтрокиВТипе = Найти(СтрокаСравнения.ТипыИсточника, "Строка");
			
			Если НаличиеСтрокиВТипе
				И (СтрокаСравнения.Источник.КвалификаторыСтроки_Длина <> СтрокаСравнения.Приемник.КвалификаторыСтроки_Длина
					ИЛИ СтрокаСравнения.Источник.КвалификаторыСтроки_Фиксированная <> СтрокаСравнения.Приемник.КвалификаторыСтроки_Фиксированная) Тогда
				
				Возврат Истина;	
				
			КонецЕсли;
			
			НаличиеДатыВТипе = Найти(СтрокаСравнения.ТипыИсточника, "Дата");
			
			Если НаличиеДатыВТипе
				И (СтрокаСравнения.Источник.КвалификаторыДаты_Состав <> СтрокаСравнения.Приемник.КвалификаторыДаты_Состав) Тогда
				
				Возврат Истина;	
				
			КонецЕсли;
			
		Иначе
			
			Возврат Истина;
						
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ДобавитьСтрокуВОбщееДерево(СтрокиДерева, СтрокаСравнения)
	
	СтрокаДобавления = СтрокиДерева.Строки.Добавить();	
	СтрокаДобавления.РезультатСравнения = 0;
	
	Если ЗначениеЗаполнено(СтрокаСравнения.Источник) Тогда
		СтрокаДобавления.ИсходнаяКонфигурация = СтрокаСравнения.Источник;
		Если Не ЗначениеЗаполнено(СтрокаСравнения.Приемник) Тогда
			СтрокаДобавления.РезультатСравнения = 1;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаСравнения.Приемник) Тогда
		СтрокаДобавления.КонфигурацияСравнения = СтрокаСравнения.Приемник;
		Если Не ЗначениеЗаполнено(СтрокаСравнения.Источник) Тогда
			СтрокаДобавления.РезультатСравнения = 2;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДобавления.РезультатСравнения = 0 Тогда
		
		Если СтрокаСравнения.ТипыИсточника <> СтрокаСравнения.ТипыПриемника
			ИЛИ СтрокаСравнения.ЭтоГруппаИсточник <> СтрокаСравнения.ЭтоГруппаПриемник
			ИЛИ СтрокаСравнения.ВидИсточника <> СтрокаСравнения.ВидПриемника Тогда
			
			СтрокаДобавления.РезультатСравнения = 3;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаСравнения.ВидИсточника) Тогда
		СтрокаДобавления.ВидИсточника = СтрокаСравнения.ВидИсточника;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаСравнения.ВидПриемника) Тогда
		СтрокаДобавления.ВидПриемника = СтрокаСравнения.ВидПриемника;
	КонецЕсли;	
		
	Возврат СтрокаДобавления;
	
КонецФункции

&НаСервере
Процедура ОпределитьРазницуТипов(ТаблицаТипов, Источник, Приемник)
	
	// заполняем таблицу типами источника и приемника
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Свойства")
		И Не Источник.Пустая() Тогда
		
		Для Каждого ТипДанных Из Источник.Типы Цикл
			
			СтрокаТаблицы = ТаблицаТипов.Добавить();	
			СтрокаТаблицы.ТипИсточника = ТипДанных.Тип;
			СтрокаТаблицы.ИмяТипаИсточника = ТипДанных.Тип.Имя;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Приемник) = Тип("СправочникСсылка.Свойства")
		И Не Приемник.Пустая() Тогда
		
		Для Каждого ТипДанных Из Приемник.Типы Цикл
			
			ИмяТипаПриемника = ТипДанных.Тип.Имя;
			СтрокаТаблицы = ТаблицаТипов.Найти(ИмяТипаПриемника, "ИмяТипаИсточника");
			Если СтрокаТаблицы = Неопределено Тогда
				
				СтрокаТаблицы = ТаблицаТипов.Добавить();
				СтрокаТаблицы.ТипПриемника = ТипДанных.Тип;
				
			Иначе
				
				ТаблицаТипов.Удалить(СтрокаТаблицы);
				
			КонецЕсли;			
						
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРекурсивноНеНужныеСтрокиДерева(СтрокиДерева, Уровень = 0)
	
	Номер = СтрокиДерева.Количество() - 1;
	Пока Номер >= 0 Цикл
		
		СтрокаМетаданного = СтрокиДерева[Номер];
		
		УдалитьРекурсивноНеНужныеСтрокиДерева(СтрокаМетаданного.Строки, Уровень + 1);
		
		Если Уровень > 0 Тогда
		
			Если СтрокаМетаданного.РезультатСравнения = 0
				И СтрокаМетаданного.Строки.Количество() = 0 Тогда
			
				СтрокиДерева.Удалить(СтрокаМетаданного);						
									
			КонецЕсли;
			
		КонецЕсли;
		
		Номер = Номер - 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьФильтрациюПриВыводеДерева(ДеревоДляЗаполнения = Неопределено)
	ПолныйРезультатСравненияДерево = ПолныйРезультатСравнения.Получить();
	Если ПолныйРезультатСравненияДерево.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если ДеревоДляЗаполнения = Неопределено Тогда
		ДеревоДляЗаполнения = РеквизитФормыВЗначение("ДеревоРезультатСравнения", Тип("ДеревоЗначений"));
	КонецЕсли;
	ДеревоДляЗаполнения.Строки.Очистить();
	СкопироватьРекурсивноСтрокиДереваПоФильтрам(ПолныйРезультатСравненияДерево.Строки, ДеревоДляЗаполнения.Строки);	
	
	ДеревоДляЗаполнения.Строки.Сортировать("РезультатСравнения Убыв", Истина);
	ЗначениеВРеквизитФормы(ДеревоДляЗаполнения, "ДеревоРезультатСравнения");
КонецПроцедуры

&НаСервере
Процедура СкопироватьРекурсивноСтрокиДереваПоФильтрам(СтрокиИсходные, СтрокиПриемника)
	
	Для Каждого СтрокаДерева Из СтрокиИсходные Цикл
		
		СтрокаДобавления = Неопределено;
		
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			
			НужноДобавлять = ОпределитьПоПравиламПодходитСтрокаДерева(СтрокаДерева);
			
			Если НужноДобавлять Тогда
			
				СтрокаДобавления = СтрокиПриемника.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДобавления, СтрокаДерева);
				
			КонецЕсли;
			
		Иначе
			
			Если (СтрокаДерева.РезультатСравнения = 1
				И ДобавленныеОбъекты)
				ИЛИ (СтрокаДерева.РезультатСравнения = 2
				И УдаленныеОбъекты)
				ИЛИ (СтрокаДерева.РезультатСравнения = 3
				И ИзмененныеОбъекты) Тогда
				
				НужноДобавлять = ОпределитьПоПравиламПодходитСтрокаДерева(СтрокаДерева);
				
				Если НужноДобавлять Тогда
				
					СтрокаДобавления = СтрокиПриемника.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДобавления, СтрокаДерева);
					
					Если (СтрокаДобавления.РезультатСравнения = 1
						И НЕ ДобавленныеОбъекты)
						ИЛИ (СтрокаДобавления.РезультатСравнения = 2
						И НЕ УдаленныеОбъекты)
						ИЛИ (СтрокаДобавления.РезультатСравнения = 3
						И НЕ ИзмененныеОбъекты) Тогда
						
						СтрокаДобавления.РезультатСравнения = 0;
						
					КонецЕсли;
						
				КонецЕсли;									
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаДобавления <> Неопределено
			И СтрокаДерева.Строки.Количество() > 0 Тогда
			
			СкопироватьРекурсивноСтрокиДереваПоФильтрам(СтрокаДерева.Строки, СтрокаДобавления.Строки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьПоПравиламПодходитСтрокаДерева(СтрокаДерева)
	
	НужноДобавлять = Истина;
	
	Если НЕ ОбъектыСПравилами Тогда
		Возврат НужноДобавлять;
	КонецЕсли;
					
	// проверка на наличие правил обмена
	Источник = СтрокаДерева.ИсходнаяКонфигурация;	
	Приемник = СтрокаДерева.КонфигурацияСравнения;	
	
	УровеньДерева = СтрокаДерева.Уровень();
	Если УровеньДерева = 2 Тогда
			
		// 2 - уровень ПКО
		// а дальше ПКС и ПКЗ
		
		МассивПКО = ПолучитьПКО(Источник, Приемник);
		
		НужноДобавлять = МассивПКО.Количество() > 0;		
	
	КонецЕсли;		
	
	Возврат НужноДобавлять;
		
КонецФункции

&НаСервере
Функция ПолучитьПКО(ИсходнаяКонфигурация, КонфигурацияСравнения)
	
	МассивПКО = Новый Массив();
	ЭтоКонвертацияXDTO = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "ТипКонвертации") = Перечисления.ТипыКонвертаций.XDTO);
	МассивОбъектов = Новый Массив();
	Если ЗначениеЗаполнено(ИсходнаяКонфигурация)
		И ТипЗнч(ИсходнаяКонфигурация) = Тип("СправочникСсылка.Объекты") Тогда
		МассивОбъектов.Добавить(ИсходнаяКонфигурация);
	КонецЕсли;
	Если ЗначениеЗаполнено(КонфигурацияСравнения)
		И ТипЗнч(КонфигурацияСравнения) = Тип("СправочникСсылка.Объекты") Тогда
		МассивОбъектов.Добавить(КонфигурацияСравнения);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПравилаКонвертацииОбъектов.Ссылка КАК ПКО
	               |ИЗ
	               |	Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
				   |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				   |	Справочник.СоставыКонвертаций КАК Состав
				   |ПО Состав.ЭлементКонвертации = ПравилаКонвертацииОбъектов.Ссылка
				   |ГДЕ 
				   |	Состав.Владелец = &Конвертация И НЕ Состав.ПометкаУдаления И НЕ Состав.Отключить
				   |	И (ПравилаКонвертацииОбъектов.ОбъектКонфигурации В (&МассивОбъектов)
				   |		ИЛИ ПравилаКонвертацииОбъектов.ОбъектКонфигурацииКорреспондент В (&МассивОбъектов) )
				   |	И ПравилаКонвертацииОбъектов.ПометкаУдаления = ЛОЖЬ
				   |ОБЪЕДИНИТЬ ВСЕ
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ПравилаКонвертацииОбъектов.Ссылка КАК ПКО
	               |ИЗ
	               |	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПравилаКонвертацииОбъектов
				   |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				   |	Справочник.СоставыКонвертаций КАК Состав
				   |ПО Состав.ЭлементКонвертации = ПравилаКонвертацииОбъектов.Ссылка
				   |ГДЕ 
				   |	Состав.Владелец = &Конвертация И НЕ Состав.ПометкаУдаления И НЕ Состав.Отключить
				   |	И (ПравилаКонвертацииОбъектов.ОбъектКонфигурации В (&МассивОбъектов)
				   |		ИЛИ ПравилаКонвертацииОбъектов.ОбъектКонфигурацииКорреспондент В (&МассивОбъектов) )
				   |	И ПравилаКонвертацииОбъектов.ПометкаУдаления = ЛОЖЬ 
				   |";
	Если ЭтоКонвертацияXDTO Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ ПравилаКонвертацииОбъектов.ОбъектКонфигурацииКорреспондент В (&МассивОбъектов)", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
	
	МассивПКО = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПКО");
	
	Возврат МассивПКО;	
	
КонецФункции

&НаКлиенте
Функция Уровень(СтрокаДерева)
   Родитель = СтрокаДерева.ПолучитьРодителя();
   Возврат ?(Родитель = Неопределено, 0, 1 + Уровень(Родитель));
КонецФункции

&НаКлиенте
Процедура РазвернутьДерево()
	Для Каждого Уровень1 Из ДеревоРезультатСравнения.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки = Уровень1.ПолучитьИдентификатор();
		Элементы.ДеревоРезультатСравнения.Развернуть(ИдентификаторСтроки);
		Для Каждого Уровень2 Из Уровень1.ПолучитьЭлементы() Цикл
			ИдентификаторСтроки = Уровень2.ПолучитьИдентификатор();
			Элементы.ДеревоРезультатСравнения.Развернуть(ИдентификаторСтроки);
		КонецЦикла;
	КонецЦикла; 	
КонецПроцедуры
#КонецОбласти
